Repository: wambugu71/SwiftScanner
Catalog: lib/l10n/app_*.arb
Languages: sw, ta

# navScan
source: Scan
sw: Chunguza
ta: ஸ்கேன்

# navHistory
source: History
sw: Historia
ta: வரலாறு

# navSettings
source: Settings
sw: Mipangilio
ta: அமைப்புகள்

# navAbout
source: About
sw: Kuhusu
ta: பற்றி

# homeTitle
source: QR Code Scanner
sw: Kichunguzi cha QR Code
ta: QR குறியீடு ஸ்கேனர்

# homeInstruction
source: Point your camera at a QR code to scan it
sw: Elekeza kamera yako kwenye QR code ili kuichunguza
ta: QR குறியீட்டை ஸ்கேன் செய்ய உங்கள் கேமராவை அதன் மீது செலுத்துங்கள்

# homeFlashOn
source: Flash On
sw: Mwanga Umewashwa
ta: ஃபிளாஷ் ஆன்

# homeFlashOff
source: Flash Off
sw: Mwanga Umezimwa
ta: ஃபிளாஷ் ஆஃப்

# homeSwitchCamera
source: Switch Camera
sw: Badilisha Kamera
ta: கேமராவை மாற்று

# homeSelectImage
source: Select Image
sw: Chagua Picha
ta: படத்தைத் தேர்ந்தெடு

# settingsTitle
source: Settings
sw: Mipangilio
ta: அமைப்புகள்

# settingsLanguage
source: Language
sw: Lugha
ta: மொழி

# settingsHapticFeedback
source: Haptic Feedback
sw: Mzunguko wa Kugusa
ta: ஹாப்டிக் பின்னூட்டம்

# settingsHapticFeedbackDesc
source: Vibrate when QR code is detected
sw: Tetemeka wakati QR code inapogundulwa
ta: QR குறியீடு கண்டறியப்படும்போது அதிர்வு

# introWelcome
source: Welcome to Swift Scan
sw: Karibu Swift Scan
ta: Swift Scan-க்கு வரவேற்கிறோம்

# introTitle1
source: Scan QR Codes
sw: Chunguza QR Codes
ta: QR குறியீடுகளை ஸ்கேன் செய்யுங்கள்

# introDesc1
source: Quickly scan any QR code using your camera with lightning fast detection
sw: Chunguza haraka QR code yoyote kwa kutumia kamera yako na ugunduzwe wa haraka
ta: உங்கள் கேமராவைப் பயன்படுத்தி மின்னல் வேக கண்டறிதலுடன் எந்த QR குறியீட்டையும் விரைவாக ஸ்கேன் செய்யுங்கள்

# introTitle2
source: View History
sw: Angalia Historia
ta: வரலாற்றைப் பார்க்கவும்

# introDesc2
source: Keep track of all your scanned codes and access them anytime
sw: Fuatilia codes zote ulizozichunguza na uzifikie wakati wowote
ta: உங்கள் அனைத்து ஸ்கேன் செய்யப்பட்ட குறியீடுகளின் கணக்கை வைத்துக்கொண்டு எந்த நேரத்திலும் அவற்றை அணுகவும்

# introTitle3
source: Share & Save
sw: Shiriki na Hifadhi
ta: பகிர் & சேமி

# introDesc3
source: Copy, share, or open scanned content with just a tap
sw: Nakili, shiriki, au fungua maudhui yaliyochunguzwa kwa mguso mmoja tu
ta: ஒரே தட்டுதலில் ஸ்கேன் செய்யப்பட்ட உள்ளடக்கத்தை நகலெடுக்கவும், பகிரவும் அல்லது திறக்கவும்

# introNext
source: Next
sw: Ifuatayo
ta: அடுத்து

# introGetStarted
source: Get Started
sw: Anza
ta: தொடங்குங்கள்

# aboutTitle
source: About Swift Scan
sw: Kuhusu Swift Scan
ta: Swift Scan பற்றி

# aboutVersion
source: Version
sw: Toleo
ta: பதிப்பு

# aboutDescription
source: Swift Scan is a powerful and intuitive QR code scanner that makes scanning codes faster and easier than ever. Built with modern technology to provide lightning-fast detection and a seamless user experience.
sw: Swift Scan ni kichunguzi cha QR code chenye nguvu na cha urahisi ambacho hufanya uchunguzi wa codes kuwa haraka na rahisi kuliko hapo awali. Kimejengwa kwa teknolojia ya kisasa kutoa ugunduzwe wa kasi ya umeme na uzoefu wa kiutumiaji usio na mshono.
ta: Swift Scan ஒரு சக்திவாய்ந்த மற்றும் உள்ளுணர்வுள்ள QR குறியீடு ஸ்கேனர் ஆகும், இது குறியீடுகளை ஸ்கேன் செய்வதை முன்னெப்போதையும் விட வேகமாகவும் எளிதாகவும் செய்கிறது. மின்னல் வேக கண்டறிதல் மற்றும் தடையற்ற பயனர் அனுபவத்தை வழங்க நவீன தொழில்நுட்பத்துடன் கட்டமைக்கப்பட்டுள்ளது.

# aboutFeatures
source: Features
sw: Vipengele
ta: அம்சங்கள்

# aboutFeature1
source: Lightning-fast QR code detection
sw: Ugunduzwe wa kasi ya umeme wa QR code
ta: மின்னல் வேக QR குறியீடு கண்டறிதல்

# aboutFeature2
source: Support for multiple QR code formats
sw: Msaada wa mifumo mingi ya QR code
ta: பல QR குறியீடு வடிவங்களுக்கான ஆதரவு

# aboutFeature3
source: Scan history with easy access
sw: Historia ya uchunguzi na ufikivu wa urahisi
ta: எளிதான அணுகலுடன் ஸ்கேன் வரலாறு

# aboutFeature4
source: Share and save scanned content
sw: Shiriki na hifadhi maudhui yaliyochunguzwa
ta: ஸ்கேன் செய்யப்பட்ட உள்ளடக்கத்தை பகிரவும் சேமிக்கவும்

# aboutFeature5
source: Dark and light theme support
sw: Msaada wa mandhari ya giza na mwanga
ta: இருண்ட மற்றும் வெளிச்ச தீம் ஆதரவு

# aboutFeature6
source: Multiple language support
sw: Msaada wa lugha nyingi
ta: பல மொழி ஆதரவு

# aboutDeveloper
source: Developer
sw: Msanidi
ta: டெவலப்பர்

# aboutDeveloperName
source: Swift Scan Team
sw: Timu ya Swift Scan
ta: Swift Scan குழு

# aboutContact
source: Contact Us
sw: Wasiliana Nasi
ta: எங்களை தொடர்பு கொள்ளுங்கள்

# aboutEmail
source: Email
sw: Barua Pepe
ta: மின்னஞ்சல்

# aboutWebsite
source: Website
sw: Tovuti
ta: வலைத்தளம்

# aboutPrivacy
source: Privacy Policy
sw: Sera ya Faragha
ta: தனியுரிமை கொள்கை

# aboutTerms
source: Terms of Service
sw: Masharti ya Huduma
ta: சேவை விதிமுறைகள்

# aboutLicenses
source: Open Source Licenses
sw: Leseni za Chanzo Huria
ta: திறந்த மூல உரிமங்கள்
